# print("국내 연구팀이 3D 바이오프린팅 기술로\
#       \n실명을 일으키는 난치성 안질환을 재현하는 데 성공했다.\
#       \n질환을 재현하면 병리 현상에 대한 이해가 높아져\
#       \n신약 개발 가능성이 높아지게 된다.\
#       \n포스텍은 조동우 기계공학과 특임교수, 원재연 은평성모병원 안과 교수, 김정주 한국외대 교수 공동연구팀이 3D 바이오프린팅 기술로 ‘망막-온-어-칩’을 제작하고 망막정맥폐쇄질환을 체외에서 재현하는 데 성공했다고 24일 밝혔다. 망막-온-어-칩은 작은 칩 위에 망막을 배양해 망막의 기능과 특성을 모방하도록 하는 기술이다.")

# """ 쌍따옴표 3개는 있는 그대로 출력
print("""국내 연구팀이 3D 바이오프린팅 기술로
실명을 일으키는 난치성 안질환을 재현하는 데 성공했다. 
질환을 재현하면 병리 현상에 대한 이해가 높아져
신약 개발 가능성이 높아지게 된다. 
포스텍은 조동우 기계공학과 특임교수, 
원재연 은평성모병원 안과 교수, 
김정주 한국외대 교수 공동연구팀이 3D 바이오프린팅 기술로 
‘망막-온-어-칩’을 제작하고 망막정맥폐쇄질환을 체외에서 
재현하는 데 성공했다고 24일 밝혔다. 
망막-온-어-칩은 작은 칩 위에 망막을 
배양해 망막의 기능과 특성을 모방하도록 하는 기술이다.""")
